cases/electrochemicalFoam/1mm_2D_inflow/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type 		    zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    currentCollector
    {
        type            zeroGradient;
    }

    separator
    {
        type            zeroGradient;
    }    
 
    frontAndBack 
    {
        type            empty;
    }
    wall 
    {
        type            zeroGradient;
    }    
}


// ************************************************************************* //
