cases/electrochemicalFoam/1mm_2D_inflow/system/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//momentumSource
//{
//    type            pressureGradientExplicitSource;
//    active          on;            //on/off switch
//    selectionMode   all;       //cellSet // points //cellZone
//
//    pressureGradientExplicitSourceCoeffs
//    {
//        fieldNames  (U);
//        Ubar        ( 0 0.011 0 );
//    }
//}


// ************************************************************************* //
